{
  "backend/main.mo": "Actor managing departments, semesters, subjects, resources, and user profiles with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report linking specific frontend files to build issues, department dropdown correctness, and loading-state requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base theme variables defining light/dark OKLCH color system and global background/foreground styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main.tsx module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/account/MyPrincipalBox.tsx": "Displays the user's principal ID with copy‑to‑clipboard support when authenticated.",
  "frontend/src/components/admin/AdminGuard.tsx": "Protects admin routes by enforcing login, showing loading states, and blocking access for non-admins.",
  "frontend/src/components/admin/AdminHelpSection.tsx": "Help card explaining how to upload or link resources with organization tips for admins.",
  "frontend/src/components/admin/DepartmentManager.tsx": "Admin UI for listing departments and managing CRUD dialogs for departments, semesters, and subjects.",
  "frontend/src/components/admin/ResourceManager.tsx": "Admin interface to add, edit, and remove resources with support for URL/file uploads and flattened resource listing.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout wrapper with header, footer, and routed page content.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing copyright, admin link, and external attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, logo, mobile menu, and login button.",
  "frontend/src/components/resources/EmptyState.tsx": "Generic empty-state card with icon, title, and description.",
  "frontend/src/components/resources/ResourceFilters.tsx": "Filter panel for searching and narrowing resources by department, semester, subject, and type.",
  "frontend/src/components/resources/ResourceList.tsx": "Displays a list of resources with type badges, context info, and open-link action.",
  "frontend/src/features/admin/resourceMutations.ts": "Defines React Query mutations for adding, editing, and removing resources, each invalidating the departments query on success.",
  "frontend/src/features/admin/structureMutations.ts": "Provides mutations for managing departments and subjects via the actor, with automatic departments query invalidation.",
  "frontend/src/features/admin/useAdminStatus.ts": "Fetches and exposes admin status based on the current identity, handling missing or failing admin checks safely.",
  "frontend/src/features/catalog/catalogSearch.ts": "Implements resource filtering by keyword, department, semester, subject, and derived resource type.",
  "frontend/src/features/catalog/useCatalog.ts": "Loads all departments using React Query and ties query readiness to actor initialization.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, identity loading, and state tracking for authentication.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theming for the UI.",
  "frontend/src/lib/resourceType.ts": "Derives a resource type from its title and optional URL using keyword matching.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with tabs for resource and structure management behind an admin guard.",
  "frontend/src/pages/BrowsePage.tsx": "Renders a department→semester→subject browser with loading, empty, and subject list states using fetched catalog data.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero and feature sections with navigation to browse and search pages.",
  "frontend/src/pages/SearchPage.tsx": "Builds a searchable, filterable resource list by flattening all department data and handling loading and error states.",
  "frontend/src/pages/SubjectPage.tsx": "Shows a subject’s resources with breadcrumb navigation and handles loading and not-found cases.",
  "frontend/src/utils/copyToClipboard.ts": "Provides a clipboard copy utility with modern API usage and a textarea fallback.",
  "frontend/src/utils/semesterSort.ts": "Sorts semester objects numerically based on digits in their names, falling back to string comparison.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-based parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines project metadata, versioning, and existing feature requirements for the PREMJI StudyHub project."
}