{
  "backend/main.mo": "Motoko canister managing departments, semesters, subjects, resources, and user profiles with admin-protected CRUD and public read access.",
  "feature_evidence.json": "Feature evidence report linking app features to corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten descriptions summarizing major frontend files, components, and feature modules.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark theme variables for the site's design system.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, and routes for all major pages including admin.",
  "frontend/src/components/admin/AdminGuard.tsx": "Route guard enforcing Internet Identity login and admin checks before rendering admin content.",
  "frontend/src/components/admin/DepartmentManager.tsx": "Admin UI for CRUD operations on departments, semesters, and subjects using dialogs and React Query mutations.",
  "frontend/src/components/admin/ResourceManager.tsx": "Admin UI for listing, adding, editing, and deleting resources with department-semester-subject selection and validation.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and clearing cached queries.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper rendering header, footer, and routed page content.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing copyright, branding, and link to caffeine.ai with dynamic hostname tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Top navigation bar with logo, nav links, admin visibility logic, login button, and mobile menu.",
  "frontend/src/components/resources/EmptyState.tsx": "Simple empty-state card displaying an icon, title, and description.",
  "frontend/src/components/resources/ResourceFilters.tsx": "Filter panel allowing keyword, department, semester, subject, and resource-type selection.",
  "frontend/src/components/resources/ResourceList.tsx": "Displays a list of resources with type badges, optional context labels, and external open links.",
  "frontend/src/features/admin/resourceMutations.ts": "React Query mutations wrapping actor calls to add, edit, and remove resources with cache invalidation.",
  "frontend/src/features/admin/structureMutations.ts": "React Query mutation hooks for adding, editing, and removing departments, semesters, and subjects, each invalidating the departments query.",
  "frontend/src/features/admin/useAdminStatus.ts": "Provides a query to check whether the current authenticated user is an admin.",
  "frontend/src/features/catalog/catalogSearch.ts": "Utility to filter resources by keyword, structural filters, and derived resource type.",
  "frontend/src/features/catalog/useCatalog.ts": "React Query hook to fetch all departments via the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider handling Internet Identity login, identity loading, and auth-client setup.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark UI themes.",
  "frontend/src/lib/resourceType.ts": "Infers a resource type from its title or URL using keyword matching.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page with tabs for managing resources and structure, protected by an admin guard.",
  "frontend/src/pages/BrowsePage.tsx": "Browse UI for navigating departments, semesters, and subjects with loading and empty states.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature highlights, and navigation buttons to browse or search study materials.",
  "frontend/src/pages/SearchPage.tsx": "Search interface that flattens catalog resources and filters them by keyword and selected academic criteria.",
  "frontend/src/pages/SubjectPage.tsx": "Displays a subject’s resources with breadcrumb navigation and handles loading or missing subject states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, assets, and current development state."
}