{
  "backend/main.mo": "Motoko backend managing departments, semesters, subjects, resources, user profiles, and access control with admin/user permissions and storage mixins.",
  "feature_evidence.json": "Feature evidence report placeholder containing an empty features array.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files for reference or tooling purposes.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes plus global background and border rules.",
  "frontend/index.html": "Basic HTML entry point loading the SPA root element and main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster components.",
  "frontend/src/components/account/MyPrincipalBox.tsx": "UI card showing the user's principal ID with copy-to-clipboard support.",
  "frontend/src/components/admin/AdminGuard.tsx": "Route guard handling login, admin-status checks, error states, and access-denied logic before rendering admin content.",
  "frontend/src/components/admin/AdminHelpSection.tsx": "Admin guide explaining how to upload or link study materials and offering organization tips.",
  "frontend/src/components/admin/DepartmentManager.tsx": "UI for managing departments, semesters, and subjects with add, edit, and delete dialogs using catalog and admin mutations.",
  "frontend/src/components/admin/ResourceManager.tsx": "Admin interface to add, edit, and delete resources, flattening department data and supporting URL or file uploads.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles Internet Identity login/logout and manages react-query state on authentication changes.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, footer, and routed page content via Outlet.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with copyright, admin link, and external attribution link including dynamic app identifier.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, logo, login button, and mobile menu using a sheet component.",
  "frontend/src/components/resources/EmptyState.tsx": "Generic empty-state card showing an icon, title, and description.",
  "frontend/src/components/resources/ResourceFilters.tsx": "Filter panel for resources with keyword search and department, semester, subject, and type selectors.",
  "frontend/src/components/resources/ResourceList.tsx": "List view of resources showing metadata, type badge, optional context, and an open-link action.",
  "frontend/src/features/admin/resourceMutations.ts": "Provides React Query mutations for adding, editing, and removing resources, invalidating department data on success.",
  "frontend/src/features/admin/structureMutations.ts": "Defines mutations for managing departments and subjects via the actor, refreshing department queries after changes.",
  "frontend/src/features/admin/useAdminStatus.ts": "Fetches and exposes admin status using the actor and Internet Identity with React Query.",
  "frontend/src/features/catalog/catalogSearch.ts": "Implements resource filtering based on keyword, hierarchy fields, and derived resource type.",
  "frontend/src/features/catalog/useCatalog.ts": "Fetches all departments via the actor with React Query when available.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to identity, reinitializing and invalidating dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/resourceType.ts": "Determines a resource type by inspecting its title and URL for category keywords.",
  "frontend/src/main.tsx": "Initializes the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page with tabs for resource and structure management, wrapped in an admin guard.",
  "frontend/src/pages/BrowsePage.tsx": "Browse page for navigating departments, semesters, and subjects using fetched catalog data.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying hero content, feature list, and a principal box when authenticated.",
  "frontend/src/pages/SearchPage.tsx": "Search interface that flattens department data and filters resources based on keyword and multiple select filters.",
  "frontend/src/pages/SubjectPage.tsx": "Loads a specific subject’s resources, shows breadcrumbs, and displays either a resource list or an empty state.",
  "frontend/src/utils/copyToClipboard.ts": "Utility for copying text to the clipboard with a fallback for older browsers.",
  "frontend/src/utils/semesterSort.ts": "Sorts semester objects by numeric value extracted from their names, with string fallback.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters, including sessionStorage-backed retrieval.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing admin-access backend requirements and tracking new feature requests."
}