{
  "backend/main.mo": "Motoko backend defining departments, semesters, subjects, resources, and user profiles with access control and admin‑only mutation methods.",
  "feature_evidence.json": "Feature evidence record describing an admin‑gating fix and the related frontend files, components, and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries for multiple frontend files used as reference metadata for build planning.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, themes, and global styles for light and dark modes.",
  "frontend/index.html": "HTML entrypoint containing root mount node and script loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/admin/AdminGuard.tsx": "Admin route guard handling login, permission loading, error states, and explicit admin denial before rendering children.",
  "frontend/src/components/admin/AdminHelpSection.tsx": "Help panel explaining how admins can add resources via file upload or external URL with tips for organization.",
  "frontend/src/components/admin/DepartmentManager.tsx": "Manages departments and subjects with dialogs for creating, editing, and deleting, using catalog data and mutation hooks.",
  "frontend/src/components/admin/ResourceManager.tsx": "Provides UI for adding, editing, and deleting study resources, flattening department data and supporting file or URL uploads.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity and handles authentication state and errors.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main page layout with header, footer, and routed content outlet.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the site footer with branding, admin link, and external Caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the site header with navigation, logo, mobile menu, and login button.",
  "frontend/src/components/resources/EmptyState.tsx": "Shows a centered empty-state card with icon, title, and description.",
  "frontend/src/components/resources/ResourceFilters.tsx": "Provides search and filtering controls for resources by department, semester, subject, and type.",
  "frontend/src/components/resources/ResourceList.tsx": "Displays a list of resources with type badges and open links, optionally showing department context.",
  "frontend/src/features/admin/resourceMutations.ts": "Defines React Query mutations for adding, editing, and removing resources, each invalidating the departments query after success.",
  "frontend/src/features/admin/structureMutations.ts": "Provides mutations to manage departments and subjects, calling actor methods and refreshing the departments query on completion.",
  "frontend/src/features/admin/useAdminStatus.ts": "Fetches admin status for the current identity using React Query, with custom loading behavior tied to actor readiness.",
  "frontend/src/features/catalog/catalogSearch.ts": "Implements client-side filtering of resources by keyword, hierarchy IDs, and derived resource type.",
  "frontend/src/features/catalog/useCatalog.ts": "Loads all departments via actor.getAllDepartments using React Query when an actor is available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, auto-refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, logout, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes with academic-themed color tokens.",
  "frontend/src/lib/resourceType.ts": "Derives a resource type from its title or URL by checking keyword patterns, returning a standardized category.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with tabs for resource and structure management behind an admin guard.",
  "frontend/src/pages/BrowsePage.tsx": "Provides UI for browsing departments, semesters, and subjects, handling loading states and navigation.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero, feature highlights, and navigation buttons for browsing and searching materials.",
  "frontend/src/pages/SearchPage.tsx": "Loads departments, flattens resources, applies keyword and filter-based search, and displays filtered results or empty states.",
  "frontend/src/pages/SubjectPage.tsx": "Fetches department, semester, and subject data to show a subject’s resources or a not-found/empty state with breadcrumb navigation.",
  "frontend/src/utils/semesterSort.ts": "Provides a utility to sort semester objects by extracted numeric order with a string fallback.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, clearing, and managing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Stores project metadata, known issues, and pending feature requests related to fixing admin access and seeding admin state."
}