{
  "backend/main.mo": "Main canister implementing departments, semesters, subjects, resources, user profiles, and admin‑gated CRUD with blob storage and migration integration.",
  "backend/migration.mo": "Data‑migration module converting old resource structures with URLs into the new resource format that supports URL or external blob content.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend files describing layout, components, pages, and catalog utilities.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, radius values, and light/dark theme variables.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/admin/AdminGuard.tsx": "Component enforcing authentication and admin checks before rendering admin content with appropriate UI states.",
  "frontend/src/components/admin/AdminHelpSection.tsx": "Static admin help card explaining two ways to add study materials and organization tips.",
  "frontend/src/components/admin/DepartmentManager.tsx": "UI for managing departments and subjects with dialogs for add, edit, and delete operations.",
  "frontend/src/components/admin/ResourceManager.tsx": "Admin interface to add, edit, and delete study resources with support for URL and file uploads.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic session handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing header, footer, and routed content area.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing copyright, attribution, and external link with dynamic year.",
  "frontend/src/components/layout/SiteHeader.tsx": "Top navigation bar with branding, navigation links, login, and mobile menu.",
  "frontend/src/components/resources/EmptyState.tsx": "Reusable empty-state card showing an icon, title, and description.",
  "frontend/src/components/resources/ResourceFilters.tsx": "Filter panel for resources supporting keyword, department, semester, subject, and type selection.",
  "frontend/src/components/resources/ResourceList.tsx": "Renders a list of resources with type badges, optional context labels, and open buttons linking to URLs or blob files.",
  "frontend/src/features/admin/resourceMutations.ts": "Defines React Query mutations for adding, editing, and removing resources through the backend actor and invalidates department queries.",
  "frontend/src/features/admin/structureMutations.ts": "Provides mutations to manage departments and subjects via the actor API and refreshes department data on success.",
  "frontend/src/features/admin/useAdminStatus.ts": "Queries whether the current authenticated user is an admin using the actor's isCallerAdmin method.",
  "frontend/src/features/catalog/catalogSearch.ts": "Implements filtering logic for resources based on keyword, structure IDs, and derived resource type.",
  "frontend/src/features/catalog/useCatalog.ts": "Fetches all departments from the backend using React Query and the actor.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context, login handling, identity loading, and state management for Internet Identity authentication.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light/dark modes with an academic color palette.",
  "frontend/src/lib/resourceType.ts": "Derives a resource type from its title or URL using keyword checks and returns a categorized label.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface with tabs for managing resources and academic structure, protected by an admin guard.",
  "frontend/src/pages/BrowsePage.tsx": "A browsing UI for departments, semesters, and subjects, handling loading states and navigation to subject resources.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and feature cards, linking to browse and search routes.",
  "frontend/src/pages/SearchPage.tsx": "Search interface that flattens all resources, applies filters, and displays results or empty states.",
  "frontend/src/pages/SubjectPage.tsx": "Displays a specific subject’s resources with breadcrumbs and handles missing data or empty resource lists.",
  "frontend/src/utils/semesterSort.ts": "Utility to sort semesters by extracted numeric value with string fallback.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, and animations with plugins.",
  "project_state.json": "Defines the project’s current state, features, and known issues for the PREMJI study‑materials website. Includes metadata, feature list, and a reported search‑button UI error."
}