{
  "backend/main.mo": "Motoko canister managing departments, semesters, subjects, resources, and user profiles with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report linking a department-filtering UI fix to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend project files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens and light/dark theme CSS variables.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/account/MyPrincipalBox.tsx": "Component showing the user's principal ID with copy-to-clipboard support.",
  "frontend/src/components/admin/AdminGuard.tsx": "Route guard enforcing authentication and admin permissions with login, loading, and denial states.",
  "frontend/src/components/admin/AdminHelpSection.tsx": "Help panel explaining how admins can upload or link study materials with tips for organization.",
  "frontend/src/components/admin/DepartmentManager.tsx": "Manages departments, semesters, and subjects with dialogs for add, edit, and delete operations using catalog and mutation hooks.",
  "frontend/src/components/admin/ResourceManager.tsx": "Provides UI to add, edit, delete, and browse flattened resources across departments with dialog-based forms and upload handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button tied to Internet Identity with automatic retries and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, and routed content outlet.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the footer with branding, admin link, and external attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the top navigation bar with links, mobile menu, logo, and login control.",
  "frontend/src/components/resources/EmptyState.tsx": "Shows a simple placeholder card with an icon, title, and description when no content exists.",
  "frontend/src/components/resources/ResourceFilters.tsx": "Provides keyword, department, semester, subject, and type filters for narrowing resource lists.",
  "frontend/src/components/resources/ResourceList.tsx": "Renders a list of resources with metadata, badges, and links to open each item.",
  "frontend/src/features/admin/resourceMutations.ts": "Provides React Query mutations for adding, editing, and removing resources using the actor API and invalidates department data on success.",
  "frontend/src/features/admin/structureMutations.ts": "Defines mutations for managing departments and subjects through the actor API, refreshing department queries after changes.",
  "frontend/src/features/admin/useAdminStatus.ts": "Fetches and returns admin status for the current identity using actor.isCallerAdmin with safe fallbacks and proper loading state handling.",
  "frontend/src/features/catalog/catalogSearch.ts": "Implements keyword and attribute-based filtering of resources, including type inference via deriveResourceType.",
  "frontend/src/features/catalog/useCatalog.ts": "Loads all departments via the actor API with React Query and exposes adjusted loading and fetched states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor instance tied to the current identity, initializing admin access and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login, logout, and status state.",
  "frontend/src/index.css": "Sets global Tailwind styles and defines light/dark theme CSS variables for colors and typography.",
  "frontend/src/lib/resourceType.ts": "Derives a resource's type based on title and optional URL, categorizing it into predefined resource types.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin interface with tabs for managing resources and structure, gated by AdminGuard.",
  "frontend/src/pages/BrowsePage.tsx": "Provides a browse interface for departments, semesters, and subjects with loading states and nested navigation.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with hero content, feature highlights, and navigation buttons.",
  "frontend/src/pages/SearchPage.tsx": "Implements a global search page that flattens resources, applies filters, and displays results or empty states.",
  "frontend/src/pages/SubjectPage.tsx": "Loads a specific subject’s resources based on URL params and shows resource lists or a not-found state.",
  "frontend/src/utils/copyToClipboard.ts": "Utility to copy text to the clipboard using the Clipboard API with a textarea fallback.",
  "frontend/src/utils/semesterSort.ts": "Sorts semester objects numerically by extracting digits from their names.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and persisting URL parameters and session values for routing behavior.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing schema version, architectural notes, known issues, and pending feature requests for the PREMJI StudyHub project."
}