{
  "kind": "build_request",
  "title": "Fix admin access: seed admin principal and make /admin stop showing Access Denied",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Seed the user Principal `019c5b4d-8259-74a9-955b-9afe01e4fab7` as an admin in the backend AccessControl state so that after a fresh canister install, logging in with that Internet Identity is granted admin permissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "still it showing the  same please fix it fast"
        ]
      },
      "acceptanceCriteria": [
        "After a fresh deploy/install, the principal `019c5b4d-8259-74a9-955b-9afe01e4fab7` is recognized as admin by the canister (using the same permission mechanism used by admin CRUD methods).",
        "When authenticated as `019c5b4d-8259-74a9-955b-9afe01e4fab7`, admin-gated calls such as add/edit/remove operations no longer trap with \"Unauthorized\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose a backend method `isCallerAdmin()` that matches the frontend usage (the frontend calls `actor.isCallerAdmin()`), returning a boolean that is consistent with the AccessControl permission checks currently used by admin CRUD methods.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "still it showing the  same please fix it fast"
        ]
      },
      "acceptanceCriteria": [
        "The canister exports a callable method named `isCallerAdmin` (Candid) that returns `true` when the caller has `#admin` permission and `false` otherwise.",
        "Calling `isCallerAdmin()` does not trap for normal callers; it returns a boolean."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the seeded admin assignment persists across canister upgrades. If the AccessControl admin state is not currently persisted in stable state, add minimal upgrade-safe persistence, and add `backend/migration.mo` only if required by existing state per the project migration policy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "still it showing the  same please fix it fast"
        ]
      },
      "acceptanceCriteria": [
        "After upgrading the canister (without reinstall), a principal that was admin before upgrade remains admin after upgrade.",
        "No state is lost or reset unexpectedly during upgrade; persistence changes are minimal and limited to what is needed for admin assignment continuity."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the admin page gating so it no longer shows the “Access Denied” screen for the intended seeded admin user; once logged in as the seeded admin principal, `/admin` must render the Admin Panel content (tabs and managers) instead of the access-denied card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages:user-1"
        ],
        "quotes": [
          "still it showing the  same please fix it fast"
        ]
      },
      "acceptanceCriteria": [
        "When logged in with the seeded admin principal, navigating to `/admin` renders the Admin Panel UI (title and tabs) and does not display the “Access Denied” card shown in the screenshot.",
        "When logged in with a non-admin principal, `/admin` continues to show “Access Denied”.",
        "When unauthenticated, `/admin` continues to show the “Authentication Required” login prompt."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`; generate `backend/migration.mo` only if required by existing state (conditional migration policy).",
    "Do not edit files under `frontend/src/components/ui` or other immutable frontend paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Implementing new admin management UI for adding/removing admins (this request is limited to fixing access for the specified seeded principal)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}