{
  "kind": "build_request",
  "title": "Fix SearchPage deployment build error and stabilize department dropdown flow",
  "projectName": "PREMJI StudyHub",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify and fix the frontend build error that is causing deployment to fail, focusing on the Search page and its Department filter/dropdown flow and dependent catalog hooks/components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "import { useState, useMemo } from 'react';\nimport { useGetAllDepartments } from '../features/catalog/useCatalog';\n...\nimport ResourceFilters from '../components/resources/ResourceFilters';\n...\nexport default function SearchPage() { ... }"
        ]
      },
      "acceptanceCriteria": [
        "The frontend production build completes successfully without errors.",
        "The Search page (frontend/src/pages/SearchPage.tsx) renders without runtime errors in both anonymous and authenticated sessions.",
        "No changes are made to immutable frontend paths (e.g., frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Department select dropdown in the Search page filter panel reliably lists all departments returned by the backend (not only the default \"All Departments\" option) once catalog data is available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "After departments load successfully via useGetAllDepartments, the Department dropdown shows \"All Departments\" plus one option per department returned by actor.getAllDepartments().",
        "Selecting a specific department updates the filter state and enables the Semester dropdown; switching back to \"All Departments\" clears the department filter and disables the Semester dropdown until a department is selected again.",
        "The dropdown options remain correct after refetching departments (e.g., after a retry or cache invalidation)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update Search page loading/error handling so the UI blocks filter rendering (or shows a loading/skeleton state) until the actor is ready and the departments query has either fetched successfully or failed; do not treat an empty departments array as a valid loaded state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "const { data: departments, isLoading, isFetched, isError, error, refetch } = useGetAllDepartments();"
        ]
      },
      "acceptanceCriteria": [
        "While the actor is not available and/or departments are still fetching, the Search page shows the skeleton/loading UI and does not render ResourceFilters with an effectively-empty departments list.",
        "If the departments query fails, the Search page shows the existing error card UI with a working Retry button that triggers refetch().",
        "If the departments query succeeds with an empty array, the Search page still renders ResourceFilters (with only the \"All Departments\" option) and does not display the loading skeleton indefinitely."
      ]
    }
  ],
  "constraints": [
    "Keep the backend as a single Motoko actor (no new backend services).",
    "Do not edit any files under frontend/src/components/ui (compose them only).",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new backend features or changing the backend schema/APIs for departments/resources.",
    "Introducing third-party auth providers (Internet Identity only).",
    "Implementing real-time updates (no WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}